/**
 * Created with JetBrains PhpStorm.
 * User: xuheng
 * Date: 12-9-26
 * Time: 下午1:09
 * To change this template use File | Settings | File Templates.
 */
var charsContent = [
   { name:"pyzm", title:lang.pyzm, content:toArray("☀,☁,🌀,🌁,🌂,🌃,🌄,🌅,🌆,🌇,🌈,🌉,🌊,🌋,🌌,⛄,⛅,☔,⚡,🌏,🌑,🌔,🌓,🌙,🌕,🌛,🌟,🌠,🕐,🕑,🕒,🕓,🕔,🕕,🕖,🕗,🕘,🕙,🕚,🕛,⌚,⌛,⏰,⏳,♈,♉,♊,♋,♌,♍,♎,♏,♐,♑,♒,♓,⛎,🍀,🌷,🌱,🍁,🌸,🌹,🍂,🍃,🌺,🌻,🌴,🌵,🌾,🌽,🍄,🌰,🌼,🌿,🍒,🍌,🍎,🍊,🍓,🍉,🍅,🍆,🍈,🍍,🍇,🍑,🍏,👀,👂,👃,👄,👅,💄,💅,💆,💇,💈,👤,👦,👧,👨,👩,👪,👫,👮,👯,👰,👱,👲,👳,👴,👵,👶,👷,👸,👹,👺,👻,👼,👽,👾,👿,💀,💁,💂,💃,🐌,🐍,🐎,🐔,🐗,🐫,🐘,🐨,🐒,🐑,🐙,🐚,🐛,🐜,🐝,🐞,🐠,🐡,🐢,🐤,🐥,🐦,🐣,🐧,🐩,🐟,🐬,🐭,🐯,🐱,🐳,🐴,🐵,🐶,🐷,🐻,🐹,🐺,🐮,🐰,🐸,🐾,🐲,🐼,🐽,☺,😠")},
      { name:"lmsz", title:lang.lmsz, content:toArray("😩,😲,😞,😵,😰,😒,😍,😤,😜,😝,😋,😘,😚,😷,😳,😃,😅,😆,😁,😂,😊,😄,😢,😭,😨,😣,😡,😌,😖,😔,😱,😪,😏,😓,😥,😫,😉,😺,😸,😹,😽,😻,😿,😾,😼,🙀,🙅,🙆,🙇,🙈,🙊,🙉,🙋,🙌,🙍,🙎,🙏,🏠,🏡,🏢,🏣,🏥,🏦,🏧,🏨,🏩,🏪,🏫,🏬,🏯,🏰,🏭,🏮,⚓,⛪,⛲,🗻,🗼,🗽,🗾,🗿,👞,👟,👠,👡,👢,👣,👓,👕,👖,👑,👔,👒,👗,👘,👙,👚,👛,👜,👝,💰,💱,💹,💲,💳,💴,💵,💸,🇨🇳,🇩🇪,🇪🇸,🇫🇷,🇬🇧,🇮🇹,🇯🇵,🇰🇷,🇷🇺,🇺🇸,🔥,🔦,🔧,🔨,🔩,🔪,🔫,🔮,🔯,🔰,🔱,💉,💊,🅰,🅱,🆎,🅾,🅿,🎀,🎁,🎂,🎄,🎅,🎌,🎆,🎈,🎉,🎍,🎎,🎓,🎒,🎏,🎇,🎐,🎃,🎊,🎋,🎑")},
       { name:"xlzm", title:lang.xlzm, content:toArray("☎,📟,📞,📱,📲,📝,📠,📨,📩,📪,📫,📮,📰,📢,📣,📡,📤,📥,📦,📧,🔠,🔡,🔢,🔣,🔤,✂,✉,✏,✒,✔,✖,💺,💻,📎,💼,💽,💾,💿,📀,📍,📃,📄,📅,📁,📂,📓,📖,📔,📕,📗,📘,📙,📚,📛,📜,📋,📆,📊,📈,📉,📇,📌,📒,📏,📐,📑,⛳,⛵,⛺,⛽,🎽,⚾,🎾,⚽,🎿,🏀,🏁,🏂,🏃,🏄,🏆,🏈,🏊,Ⓜ,🚃,🚇,🚄,🚅,🚗,🚙,🚌,🚏,🚢,🚉,🚀,🚤,🚕,🚚,🚒,🚑,🚓,🚥,🚧,🚨,♨,✈,🎠,🎡,🎢,🎣,🎤,🎥,🎦,🎧,🎨,🎩,🎪,🎫,🎬,🎭,🀄,🎮,🎯,🎰,🎱,🎲,🎳,🎴,🃏,🎵,🎶,🎷,🎸,🎹,🎺,🎻,🎼,📷,📹,📺,📻,📼,💋,💌,💍,💎,💏,💐,💑,💒,©,®,™,ℹ,🔞,#⃣,1⃣,2⃣,3⃣,4⃣,5⃣,6⃣,7⃣,8⃣,9⃣,0⃣,🔟,📶,📳,📴,🍔,🍙,🍰,🍜,🍞,🍳,🍦,🍟,🍡,🍘,🍚,🍝,🍛,🍢,🍣,🍱,🍲,🍧,🍖,🍥,🍠,🍕,🍗,🍨,🍩,🍪,🍫,🍬,🍭,🍮,🍯,🍤,🍴,☕,🍸,🍺,🍵,🍶,🍷,🍻,🍹,↔,↕,↗,↘,↖,↙")},
	       { name:"zyzf", title:lang.zyzf, content:toArray("⬆,⬇,⬅,➡,⤴,⤵,▶,◀,⏩,⏪,⏫,⏬,🔺,🔻,🔼,🔽,⭕,❌,❎,❗,❓,❔,❕,〰,‼,⁉,➰,➿,❤,💓,💔,💕,💖,💗,💘,💙,💚,💛,💜,💝,💞,💟,♥,♠,♦,♣,♻,♿,⚠,⛔,🚬,🚭,🚩,🚲,🚶,🚹,🚺,🛀,🚻,🚽,🚾,🚼,🚪,🚫,🆑,🆒,🆓,🆔,🆕,🆖,🆗,🆘,🆙,🆚,🈁,🈂,🈚,🈯,🈲,🈳,🈴,🈵,🈶,🈷,🈸,🈹,🈺,㊙,㊗,🉐,🉑,➕,➖,➗,💠,💡,💢,💣,💤,💥,💦,💧,💨,💩,💪,💫,💬,✨,✴,✳,❄,❇,⚪,⚫,⭐,🔴,🔲,🔳,▫,▪,◽,◾,◻,◼,🔶,🔷,🔸,🔹,⬛,⬜,💮,💯,↩,↪,🔃,🔊,🔋,🔌,🔍,🔎,🔒,🔓,🔏,🔐,🔑,🔔,🔘,🔖,🔗,☑,🔙,🔚,🔛,🔜,🔝,✅,✊,✋,✌,👊,👍,👆,👇,👈,👉,👋,👏,👌,👎,👐,☝")},
   { name:"tsfh", title:lang.tsfh, content:toArray("、,。,·,ˉ,ˇ,¨,〃,々,—,～,‖,…,‘,’,“,”,〔,〕,〈,〉,《,》,「,」,『,』,〖,〗,【,】,±,×,÷,∶,∧,∨,∑,∏,∪,∩,∈,∷,√,⊥,∥,∠,⌒,⊙,∫,∮,≡,≌,≈,∽,∝,≠,≮,≯,≤,≥,∞,∵,∴,♂,♀,°,′,″,℃,＄,¤,￠,￡,‰,§,№,☆,★,○,●,◎,◇,◆,□,■,△,▲,※,→,←,↑,↓,〓,〡,〢,〣,〤,〥,〦,〧,〨,〩,㊣,㎎,㎏,㎜,㎝,㎞,㎡,㏄,㏎,㏑,㏒,㏕,︰,￢,￤,℡,ˊ,ˋ,˙,–,―,‥,‵,℅,℉,↖,↗,↘,↙,∕,∟,∣,≒,≦,≧,⊿,═,║,╒,╓,╔,╕,╖,╗,╘,╙,╚,╛,╜,╝,╞,╟,╠,╡,╢,╣,╤,╥,╦,╧,╨,╩,╪,╫,╬,╭,╮,╯,╰,╱,╲,╳,▁,▂,▃,▄,▅,▆,▇,�,█,▉,▊,▋,▌,▍,▎,▏,▓,▔,▕,▼,▽,◢,◣,◤,◥,☉,⊕,〒,〝,〞")},
 
    { name:"szfh", title:lang.szfh, content:toArray("⒈,⒉,⒊,⒋,⒌,⒍,⒎,⒏,⒐,⒑,⒒,⒓,⒔,⒕,⒖,⒗,⒘,⒙,⒚,⒛,⑴,⑵,⑶,⑷,⑸,⑹,⑺,⑻,⑼,⑽,⑾,⑿,⒀,⒁,⒂,⒃,⒄,⒅,⒆,⒇,①,②,③,④,⑤,⑥,⑦,⑧,⑨,⑩,㈠,㈡,㈢,㈣,㈤,㈥,㈦,㈧,㈨,㈩,ⅰ,ⅱ,ⅲ,ⅳ,ⅴ,ⅵ,ⅶ,ⅷ,ⅸ,ⅹ,Ⅰ,Ⅱ,Ⅲ,Ⅳ,Ⅴ,Ⅵ,Ⅶ,Ⅷ,Ⅸ,Ⅹ,Ⅺ,Ⅻ")},
    { name:"rwfh", title:lang.rwfh, content:toArray("ぁ,あ,ぃ,い,ぅ,う,ぇ,え,ぉ,お,か,が,き,ぎ,く,ぐ,け,げ,こ,ご,さ,ざ,し,じ,す,ず,せ,ぜ,そ,ぞ,た,だ,ち,ぢ,っ,つ,づ,て,で,と,ど,な,に,ぬ,ね,の,は,ば,ぱ,ひ,び,ぴ,ふ,ぶ,ぷ,へ,べ,ぺ,ほ,ぼ,ぽ,ま,み,む,め,も,ゃ,や,ゅ,ゆ,ょ,よ,ら,り,る,れ,ろ,ゎ,わ,ゐ,ゑ,を,ん,ァ,ア,ィ,イ,ゥ,ウ,ェ,エ,ォ,オ,カ,ガ,キ,ギ,ク,グ,ケ,ゲ,コ,ゴ,サ,ザ,シ,ジ,ス,ズ,セ,ゼ,ソ,ゾ,タ,ダ,チ,ヂ,ッ,ツ,ヅ,テ,デ,ト,ド,ナ,ニ,ヌ,ネ,ノ,ハ,バ,パ,ヒ,ビ,ピ,フ,ブ,プ,ヘ,ベ,ペ,ホ,ボ,ポ,マ,ミ,ム,メ,モ,ャ,ヤ,ュ,ユ,ョ,ヨ,ラ,リ,ル,レ,ロ,ヮ,ワ,ヰ,ヱ,ヲ,ン,ヴ,ヵ,ヶ,ㄅ,ㄆ,ㄇ,ㄈ,ㄉ,ㄊ,ㄋ,ㄌ,ㄍ,ㄎ,ㄏ,ㄐ,ㄑ,ㄒ,ㄓ,ㄔ,ㄕ,ㄖ,ㄗ,ㄘ,ㄙ,ㄚ,ㄛ,ㄜ,ㄝ,ㄞ,ㄟ,ㄠ,ㄡ,ㄢ,ㄣ,ㄤ,ㄥ,ㄦ,ㄧ,ㄨ")},

    { name:"ewzm", title:lang.ewzm, content:toArray("希腊字母,Α,Β,Γ,Δ,Ε,Ζ,Η,Θ,Ι,Κ,Λ,Μ,Ν,Ξ,Ο,Π,Ρ,Σ,Τ,Υ,Φ,Χ,Ψ,Ω,α,β,γ,δ,ε,ζ,η,θ,ι,κ,λ,μ,ν,ξ,ο,π,ρ,σ,τ,υ,φ,χ,ψ,ω,俄文字符,А,Б,В,Г,Д,Е,Ё,Ж,З,И,Й,К,Л,М,Н,О,П,Р,С,Т,У,Ф,Х,Ц,Ч,Ш,Щ,Ъ,Ы,Ь,Э,Ю,Я,а,б,в,г,д,е,ё,ж,з,и,й,к,л,м,н,о,п,р,с,т,у,ф,х,ц,ч,ш,щ,ъ,ы,ь,э,ю,я")},
    
    { name:"yyyb", title:lang.yyyb, content:toArray("ā,á,ǎ,à,ē,é,ě,è,ī,í,ǐ,ì,ō,ó,ǒ,ò,ū,ú,ǔ,ù,ǖ,ǘ,ǚ,ǜ,ü,i:,i,e,æ,ʌ,ə:,ə,u:,u,ɔ:,ɔ,a:,ei,ai,ɔi,əu,au,iə,εə,uə,p,t,k,b,d,g,f,s,ʃ,θ,h,v,z,ʒ,ð,tʃ,tr,ts,dʒ,dr,dz,m,n,ŋ,l,r,w,j")}

];
(function createTab(content) {
    for (var i = 0, ci; ci = content[i++];) {
        var span = document.createElement("span");
        span.setAttribute("tabSrc", ci.name);
        span.innerHTML = ci.title;
        if (i == 1)span.className = "focus";
        domUtils.on(span, "click", function () {
            var tmps = $G("tabHeads").children;
            for (var k = 0, sk; sk = tmps[k++];) { 
                sk.className = "";
            }
            tmps = $G("tabBodys").children;
            for (var k = 0, sk; sk = tmps[k++];) {
                sk.style.display = "none";
            }
            this.className = "focus";
            $G(this.getAttribute("tabSrc")).style.display = "";
        });
        $G("tabHeads").appendChild(span);
        domUtils.insertAfter(span, document.createTextNode("\n"));
        var div = document.createElement("div");
        div.id = ci.name;
        div.style.display = (i == 1) ? "" : "none";
        var cons = ci.content;
        for (var j = 0, con; con = cons[j++];) {
            var charSpan = document.createElement("span");
            charSpan.innerHTML = con;
            domUtils.on(charSpan, "click", function () {
                editor.execCommand("insertHTML", this.innerHTML);
                dialog.close();
            });
            div.appendChild(charSpan);
        }
        $G("tabBodys").appendChild(div);
    }
})(charsContent);
function toArray(str) {
    return str.split(",");
}
