<?php

/*
 * @ 2015/08/06
 * 1、更新 回帖图片，应用场景-二手市场等
 * 2、更新回帖性别显示错误
 * 3、更新管理员编辑帖子作者改变bug
 * 4、更新上传图片进度条显示及上传失败提醒
 * */

/*
 * @ 2015/08/07
 * 1、优化个人中心查看自己的帖子
 * 2、优化积分兑换后台管理
 * 3、修复 任务大厅一键导入现有任务
 * 4、修复个人中心 发帖点赞消息提醒
 * 5、新增：会员组计费功能
 * 6、新增积分充值、余额充值功能
 * 7、新增上传商品帖子功能
 * 8、新增敏感词过滤功能
 * 9、后台锁定、加精、置顶、删除、加入黑名单等操作 执行相应积分奖惩
 * 10、设置连续发帖时间间隔 间隔发帖、间隔回帖、间隔点赞等
 * 11、微赞商城更新改为在线更新
 *
 * */


/*
 * @ 2015/08/08
 * 1、增加后台发帖功能，发帖类型 ： 商品帖子，普通帖子、图文帖子、音乐帖、视频贴、投票贴、实物招领帖子、招聘帖子、
 * 2、增加 发帖、回帖时间间隔
 * 3、更新：积分、余额单位随系统变化
 * 4、二级分类
 * */

/*
 * @2015/08/9
 *
 * 1、优化返回重复发帖问题
 * 2、优化返回重复回复问题
 * 3、优化前台管理员：置顶、加精、删帖、编辑等功能按钮
 * 4、移动端首页导航栏目自定义
 * 5、完善二级分类页面
 * */

/*
 * @2015/08/10
 *
 * 后台管理改版
 *
 * 	首页
 * 		1、管理首页
 * 		2、常用操作
 * 	全局
 * 		1、站点信息
 * 		2、分享设置
 * 		3、用户权限
 * 		4、积分设置
 * 		5、搜索设置
 * 		6、地区设置
 * 		7、排行榜设置
 * 	界面
 * 		1、导航设置
 * 		2、界面设置
 * 		3、风格管理
 * 		4、表情管理
 * 		5、表态动作
 * 		6、主题鉴定
 * 		7、在线列表
 *  用户
 *  	1、用户管理
 *  	2、禁止openid
 *  	3、管理组
 *  	4、用户组
 *  	5、推荐管理
 *  	6、认证设置
 *  论坛
 *  	1、版块管理
 *  	2、版块合并
 *  	3、分类信息
 *  	4、首页四格
 *  仿灌水
 *  	1、基本设置
 *  	2、关键字过滤
 *  运营：
 *  	1、站点公告
 *  	2、站点广告
 *  	3、任务大厅
 *  	4、道具商城
 *  	5、勋章商城
 *  	6、站点帮助
 *  	7、电子商务
 *  	8、充值卡密
 *  插件：
 *  	1、系统插件
 *  工具：
 *  	1、更新缓存
 *  	2、更新统计
 *  	3、运行记录
 *  	4、计划任务
 *
 * */

/*
 * 1、修复 多模板bug
 * 2、新增o2o卡卷核销功能
 *
 * */

/*
 * @2015/8/12
 * 1、修复 点赞重复技术
 * 2、修复回帖无回复内容，显示回复已删除bug
 * 3、修复 图片上传bug 和发帖图片上传bug
 * 4、修复每次升级 7牛设置丢失。
 * 5、修复 系统设置bug
 * 6、修复提交回复时，点击取消提交表单bug
 * 7、修复 新升级后 上传图片没有提交之前 删除按钮失效
 * 8、首页下拉刷新 已完成
 * 9、列表也下拉刷新已完成
 * 10、去掉阅读消息 信息
 * 11、个人中心-我的消息页面，优化，只显示未读消息
 * 12、个人中心主页，显示未读消息个数及未完成任务个数
 * 13、首页 返回到顶部bug修复
 * */

/*
 * @2015/8/13
 * 1、修复 回帖登陆失效
 * 2、修复设置会员权限有问题
 * 3、完成回复的点赞功能
 * 4、完成回复的回复功能
 * 5、修复分享bug
 * */

/*
 * @2015/8/14
 * 1、添加后台分享提示控制
 * 2、增加并完善打赏贴
 * 3、修复积分充值、余额充值bug
 * 4、优化o2o申请机制
 * 
 * */

/*
 * @2015/8/15
 * 1、优化发帖选择分类提醒、强制必须同意免责声明、并限制标题不能为空
 * 2、升级版本3.0.0 并优化后台操作界面
 * 3、修复后台添加子主题bug
 * 4、版块分类滑动控制、首页导航滑动控制
 * */
 
die(json_encode('meepo'));